#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "94c60b5527f8daeca5df0197abf2cd75" -> "2d543018eec5a1496b5131ba974d2420"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "79232d6554dd2eb5f679253ee7af430f" -> "5b0c5fd81eb56c712ebbe5ce3e2205ce"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "92c67221f6394b6e9bbfb95508d3c6ce" -> "7fedf9f660607a62c7fd3c6b06373f03"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "a68c2e53325f5c05862c4d84c47ae9c0" -> "e004a9b0990faa252a6c32a6e0be86dc"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "e8dc435a768174e901f4a37bd61cdb6d" -> "a54cdcf4c93070d2183b499b44e9fda2"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "58205e3b9fa0e62b1b0775101a3ba0dd" -> "a04280e1fcf49f8b861e37f9bc4ef656"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "9ac3498f6b2f3552df4e64b10d5475a9" -> "d4e34f33e17aa1801f20607450c26832"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "85e2799416bd4715be28288fe2dec60b" -> "dc3fd3969128fd018761661083ef14d1"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f1f8577270136526874ceea613849d1e" -> "bc5f215919b395bb3b7f6f4e218b499e"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f5f0153011f71e2eb80a234246dbe9e6" -> "5f94fd71ad06e8ba624b3e39ba5dea89"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "82bf48486c047e70101bc24943a9f108" -> "e93640af98d7fdd377424ec039f554c3"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b2368f743c68c7cddb6283fb0d0facf9" -> "1849a006d785ff601806f57be9f73b08"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "13c25d7a06c5a9795bec7a0cbd2a3f1c" -> "5c3ae45451b4d29e4eeee4f0ba1a8b3c"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "42b3eb42cf1380d7c58c0f5a88c1cb31" -> "14e51fc21f55eed1ffcbf132f8af75ac"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f4defa5d6b0c8c853c3a6c5ac7bb1773" -> "1a7c8dd9211e3b6eeb6ff3ba299caa47"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "78c2768b42fe54c72799542ff0608a46" -> "6776b226f802699ebf307ae32ce7f049"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "6b970aae15cc1510ce2eda596197203d" -> "259e6ed2babf48fb76c950b96218dd19"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "d1d4d996c5a4bb9e858e6eda9db603d0" -> "25c435679249804bc4eea6d26fc4f455"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "3b596fdff9a475ebae6c6ed41052b4f1" -> "563ead3f9430a028ec069efbdc3e4e99"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "afea37fed800073c2359301664153a40" -> "3b7a6db375128354434e6d1ce7d8f71a"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c62398c5f9140362264038e01a55ed93" -> "13ee4f2b184b9d784938f9dffba0b973"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2a7d5dfd2536f33d88819e34f7403919" -> "94936d8b16bf340cd11ab9cb58d64997"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "260d70bcc933ef2ceaba6575b6e5d6f4" -> "4ae74cb9577ecf3d7ccc9e3ae5ee98fb"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "e7dc79dd53d2befd070f71ec338248bf" -> "ddc23005ba4f3931ff42f51046899565"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "c3bbb19f713b88cafb6fc3f4a836f0cc" -> "7b538f34a731df96d3d918f056b2d8ad"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "96cd754a691ebae1dfbdec9b0b5eadcc" -> "d206c5b1c6ac5a95c9cd33989dc08598"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c473d254adc846b7ad8a0171b15e6c2f" -> "302770395a4641c10d040f409918eebd"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "bb086d0e1bb147590046cdf357e0ed03" -> "e31c12013de3be396b61089162f88d29"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5a7f99b7d446f91792dc30925e63850b" -> "df4cd530fe447b3091a94734172c6a1f"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "66c794c7f8fa1284f46a99673b4d9473" -> "943dccf9eee306a1c2eebc920c9ecb81"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "c9b28da59f7f538ccc6a142177cb13a9" -> "e32882781bc64b638cee7cd4807e65f1"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "272c0a839d74a35cd8748a7cf7053a13" -> "c7204be024e6dc5461dd0f0bb9d2f887"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "2124c527be51ac61980fbcaed3676da7" -> "8b4eb39e8c201c310950ef7d731da831"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fd6dc8c9c31e33269d179805a95350db" -> "da2c5ab05523beaeca8f46fe3d5c7389"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0c3cc57fe56983a4b65dbfc39bed1acd" -> "337b1084c81a5f53f30ef205a4e0a13b"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "871dec6a0beb697ff82d22699e5a2a83" -> "11ed8a714b1c4f1bce9de7765367a68c"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "912f45c41ff0aa6fcdfda0e750443ec5" -> "3a77122fd09e51c7f31fd02ce3cc3224"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "7ff176fb44a4b68c7675d17bc4748f1f" -> "ba9a006dc70e0bb2c5bde39b84314a8c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0c436357a3da9b5f3935c81e08bb12bd" -> "128a5aae02b4207721a35e630c9de5a0"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "24c3f8bd882347c540242ae31498b982" -> "e4bbf523b2148e67418060d14483120b"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "415620d8a5395927d897a132edc1b8f2" -> "cce4483885b1570df38e88674882599a"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "a98ee06a8e2dce011732b15b9ebbbcfa" -> "f81778254c723226bd672c750d3d11b2"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "081a7b86a6fcf68fa6fe573fecfd3d3e" -> "575a033f8b74d74588ef756b922479b6"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "bd89292f9c54ce37ad5231d2b252f1cd" -> "5693052622c4308836dbaf6b89890e47"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "edd0126229a51aba4774b5d764d72683" -> "0a2a340479e1d7b1bc536c722eaa1409"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "1ccb452cd430d1aa6ca42a46f8e6c9f0" -> "a1b00b149e4fa50f6efe91d750889293"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WgK47nsHj0Dw1D02uaYqKWzHsTaOIxp6VOclnEnZI6M=" -> "419VX3RgYlAQcUWK6g+1TG56X8SuaXywqUu9VFn7xus="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xWA87zy2Y9BZp5EDnrGvbihQCj3d/uPqHf4oWBkSgXw=" -> "kmAyQYvEN97DencaPA/8oICx3x3LmkzzYPplWPy0Cs8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2cJrTk3m3mcDa3oKuKmdAV6zyigAEPhsHkF/vYymqo=" -> "LcmlX28H8nREmQkvzEOOkOeEPAwCAJMlgGWw8DZZZQY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "4j/yTl3zSl8Xj98N2SF71sU0cgf4Hdoeh0hRBuz6WmE=" -> "ghQ5jmRPWrRv5tLOtmmt/PrHOaa1eofTGpeBuiF/frY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "wgkKDRBroe0Esu1dvaPG4wMMNMmpOe6gNWud05EqbEE=" -> "GR8TeX2MdaZRePWtj24LGi1H0SqZfHDDywas5pyssDs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "keKE5xluyiBWRyEUPkLqz7kiJC4ht/+8f01UvPCOyIM=" -> "KSF9hs0fSCgJvF1goNeqVWL4WXrH72dEJIU3TZQyhCk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "8HeBBeQ5oRD1uyH/wT/lUPXxnDyuYbSTLi4izJi9aQY=" -> "hKTrDDqwxn/4ScziJoD+nNRwq0RYY8L0t90qIWRGkMg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Za8OJskPdWh9YF05PgcvMtld8AIzKncyp3B4dFtWkxE=" -> "8mdZkS+nppBBQymx+ZqS01Rs5ddc+jaDPc+WF4+ZK1I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:19:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "M4gXGmCLMXqupk6wZN/KQJc53DMoy4vrce9eaxtfi8I=" -> "nZB6+LkZRVU8k5J1V5m+s4YVwp2T1HrGiufWExJiypo="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "vRm9sB70MS9C7x9Y26Y0Cccgs1pI7VVAqbr1H+cbZf0=" -> "y2l3yFqEptCQ1cuZVS8HXohEg9UFJb0c54ef68Dfbek="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jm16VOPilOpL3sTRi/dEu4TPATJdINzpU66PQSbRBdE=" -> "BqHRDZ4/csR/EjdjvPlyOVJrMPlsLhFuvatkzFuWDIA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAAX9DjfnzNpvPEAD45ft2dhcIkOBbzeRRYsX10tnvk=" -> "O3D/7lOdSCBSbMapEfDsy2XlGUhrjEre2RGxZ1UDVDI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "a92uRQKINNEQhxFzjxpCMYpKc2mhrZT6kTVgqEJmoio=" -> "RXM7+GBTfrvF2Sh91CBWcCS/hHSIXnik4XUW3e1Htl4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "tgyGFB34lS/S29dvwIrmU2KdmmaP/aVf5+UmlEwNtck=" -> "o38/u0vJQCXid7JG055FECou7rBTGTV+s3nuXUfLqYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbZ3AzNyS5cF9ExTnAjxXS+7NLvX82CiThJxKAb0Y6s=" -> "GsPDXu2Pqt+BiJjWwdCA6BHRephsZKztGPIdITVKnuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "hQZHs2P14q3/BbCAKb5N23MkncCeBxF26NK9ApxTjKU=" -> "kGlXLmDxF7dlfmX/r7VfJrnVbGv/B+RWgbhPNJ8tq/w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "boJGkWwqxknroaImXVKRe/Jf/gJm9T1OgFL90QpXyKs=" -> "mXS5Vfejc4RBENnk7Wx1kJVzd4dS1xDyxibtfw8eIFQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "G1Wiu8uJSYb4AxVrwOoygbAABjeeLcDGtO70brDeYqw=" -> "0Pb0AxG7FNN6XfWLFx83xlMjD0k0WOpVjLmHZ4wHxv8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "VGJoFbtoR5JVLJBYkgWjo4g8NqNHgy7NdYlZU6afhCA=" -> "hGiGmNboEsf6lcVbsvn9kDBvSdtrn2gp9qA/rWnCESE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-26T00:33:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "KUQDWkXrm/3SHAM5r2S+lul/MOzixNCk/7V8tSGbzD4=" -> "Tv8XsOBIctwgZIR0UI8QqPF1HfY98RaPHroVABdFPvA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "F6q9DHXI/6S0ESwWw4x0gGotR++ja0RvKocNrUSv2H4=" -> "BKvU+4AShJ4P4GfwYR1s12ziNP8vLP08/I4+OCLf3sI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "T6trod4Mu7YdcRBFN46IqBFRkzK3Cdze3tRioUHFqNA=" -> "2XatlmZeWXlUADpFJCaSiMmoOlNm1INF7O4tmkwnZFw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FWJsAbHzxg6Z+f7eQ9cOuv5Vjt0mUzkVbNxWmmSAwjE=" -> "YLRcIt4yk9E/Qn4aT9ZjlZYPfi+ZntbzQZZfTKRwSuI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "htNT4jcrZi8jKazvdrEH/ddOqkZHtJLropbF2Q9K0xg=" -> "5KiI7QtCfJTAVGMAMRxyrEILv4l9eno9qfw69BEGWHw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T23:57:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "oZWlk6u5nuOOmRJjAfmMZ3U3vJxFAuxLDzqUu/h+xLc=" -> "ut5tB8jizUODfWIw9+cNmOOkOo15rfYzTth34wPui98="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-26T00:00:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "yEqIWdZ04xJNYj54iMf1eoWSWIjJjxnG5hQC9MlFH6E=" -> "fnCclrvTrlWnGt+fw1vI1HtyWWL3OSS9Z87jBfGk5Po="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "yC/h6ccSB7IhmPwNbTZAD/u3h0yG1Wumm1jLgA/JN4c=" -> "TzHwfePLlwmPvc6rxZMTQ9NGzBIoOkerFRzhwHjz9Uw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "hehpgnaeSqt6lLge9IKvDhByzq5fdMAZijolVbFn2u0=" -> "eeNHyaYX9JcOzCXZXOKL0PgTyqgPd4hRkLlDljpYiNI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "OexHWWmRk1Lkfg9O9mej8nJU5mik6+zZvvMgquV/WKo=" -> "Kb/toDz0oOvLNX0PnEGvPRLrenUIGhDOw88zhlfG3wc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "W69/p3U/ebLRfE35XVKwfFKZS88TGJG+alM+8udfBcA=" -> "3wf23jdNeLvaTlEccvlP/NpC25w9AglTWtvGdYtNaQM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "n82UeTa6m+4Q7WzO2dkG/Z4kNqZsLZVWmHBj9QoV5hA=" -> "M+nGWst6uogFuDnLiKvBh4qS3OE7p74SRvRMCd0qtvc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "aqhc18kZxyEQqjECAwMCvWp+RkR0g7X7lO2KsS5NNpg=" -> "n3xuTraegZv+Yy5YHEArdmWNAmhVt37LlNZa0XMZgEA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0koqkk8bU2KSXmEHeSo3/2Z09SdFrO4XCx7yXd97ak=" -> "rtWAr6kAhD/WGADtrpKP+IR8PK2/NEJJN3953GlD3hU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "J9Vq/G3lRbh+Pz6BKahLT/NZS6W0bGxo6dneo776YGU=" -> "F/yohLH/h1b6O6mEqrIJJzdZoY5b9AzFyzHDNR+TS9U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "LNYt3xRXpj0K7PmYxeDGtx7j1KwVYU6Nk7DagcV318w=" -> "R30O0oFPSj922+lhzRP7wvlBK7W/ontta7uu5BKP//c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "9fiKCl9+XWEhkQa+lbA9H9iJwhM6xX8liToyEUhdJAc=" -> "OpNXnX+5O+4Td8/vuURZZwSFE1R/ucr3O1zKFrWJM8o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "QErCqljDkVSWvcAm7mcO/NzfF0ev0iZXVWhreAWLVCI=" -> "EIUrHVVQLvrKN9P4MbJWqhM9yTi/AaR+4WAPW2fdgH0="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "run9azCvXCVsPqafeFT7jGPxTNOVYnS8dqUhk4zLO+8=" -> "Q1Mv57tjVURsSH/e2e3cyvZl/Um7Uj6ljRDfkolrAao="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ptETTGKf/NosJ4NY/fd1nvfuOGjqAnqogwfGeYOeMoc=" -> "+ph3whLPSHzmOr/lDEJpbKRcEO3bxCMTHIGgEvIIS9U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "Rbi+XBtNCorEcD3vMnFuUo6uE2yMgKCSG9/D/jJrKC8=" -> "tfa5ht1Bj6OCW2WaIU0pfuBu7J1UuVt2zLMXWRMZvfE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "srEi9SsdMVd7567pOhnOEicJ89uigfJ+aHjEatG0J8c=" -> "Cuxnzm6U4QU5ABqLZmJA+s/fNfP2CanVoUodSM16fg8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "rYXBSNCTVlb2ia7TAiDLZRsd91Xunc4zVALvSXukojo=" -> "u8pGG4hnvWgi6aiFv4iuiiCOpOF9cNHLWmEEkCMPb4Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKQKgg2x1ksSdqapfFS+QlXthRDK8DtewJbUn09g94U=" -> "UHGOti5sspBlFGkiL595RxA/zBgOjvin89vC9wa6vRY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "/r1/ZmnYNMtdXR5S8RmhLE3GJcvHkfai2kLPqtAb/gk=" -> "ELpg1zNsO/a6OfgPvn3O08GHOm2rXgNhLZ1wPllRUWw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "S9uEpQsKnvEH8Ezbg0JyVZOxgCJYIEvRJS+VAjCtjWg=" -> "s3zTkoQtlPu9oVtY8zaczq0EfhX5z9Bzye7D0JwDEpY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-25T21:19:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "0w1zu0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*